# YOLO11-Innovation-Mix (DEA + LS)
# Targets: SOTA Object Detection & Semantic Segmentation

# Parameters
nc: 8 # number of classes
scales: # model compound scaling
  n: [0.50, 0.33, 1024] 

# 1. Backbone: Using DEAC2f for crisp boundary preservation
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, DEAC2f, [128, True]] # 2-Innovation: Boundary-aware features
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, DEAC2f, [256, True]] # 4-Innovation: High-res edge preservation
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, LSC2f, [512, True]] # 6-Innovation: Large kernel for global context
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, LSC2f, [1024, True]] # 8-Innovation: Max receptive field
  - [-1, 1, SPPF, [1024, 5]] # 9

# 2. Neck: Using LSC2f for long-range relationship matching
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, LSC2f, [512]] # 12-LS Block handles multi-scale fusion

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, DEAC2f, [256]] # 15-DEA Block refines small object boundaries

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, LSC2f, [512]] # 18

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, LSC2f, [1024]] # 21

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)
